const pages = [
  `   <div>
          <img id="title-image" src="../pic/character-title.png" alt="Character Title">
      </div>

      <h1>种族</h1>
      <p>人类是D&D世界中最常见的居民，而矮人、精灵、半身人以及许多其他神奇的奇幻种族也一样在这个世界中生活工作。而你的角色就是这些族群的成员之一。</p>
      <p>多元宇宙中的智慧种族并非都适合成为受玩家控制的冒险者角色。矮人、精灵、半身人以及人类是在冒险小队中最常见的种族。龙裔、侏儒、半精灵、半兽人以及提夫林则较少成为冒险者。卓尔，作为一种精灵亚种也属于比较少见的例子。</p>
      <p>你所选定的种族关系到该角色的方方面面，并决定了你的角色在其冒险生涯中始终贯彻的某些基本素质。当你做出决定时，请务必记住你想要扮演的角色是何种类型。例如，半身人非常适合成为行藏隐匿的游荡者；矮人可以是个顽强的战士；而精灵则更适合成为掌握奥术魔法的大师。</p>
      <p>角色的种族不仅关系到其属性值和种族特质，还可以在你创作角色背景时提供线索。在这一章中，每个种族的描述都包括了帮助你进行角色扮演的信息，其中包括角色性格、相貌外形、族群社会特点以及种族阵营倾向。当然，这些说明仅仅是一些协助你构思角色的建议，你也可以创作出与其种族大相径庭的冒险者。当你思考为何自己的角色与众不同时，为其构思相应的背景和个性会是一个很好的办法。</p>
      <p>在5e规则中（2014版），种族一共有九种：人类Human、矮人Dwarf、精灵Elf、半身人Halfling、龙裔Dragonborn、侏儒Gnome、半精灵Half-Elf、半兽人Half-Orc和提夫林Tiefling。每个种族都有其独特的特性和背景故事。由于篇幅原因不在此过多赘述，详情可参考相关资料</p>
`,
`
<h1>职业</h1>
<p>冒险者们都是非凡的人，他们渴望刺激并过着他人不敢涉及的生活。身为英雄，他们注定要去探索世界的黑暗角落，并面对那些稍微不够格都会招致失败的挑战。</p>
<p>职业是对角色能做何事最主要的概括。它不仅仅是一项专业，还是该角色躬行实践所有行为的定义。职业的概念塑造了你对世界的思考和互动方法，以及你与多元宇宙中其他人或力量的关联。例如，一名战士可能将世界看作是个规律变动的固有区间，而她自己则是这个大棋盘中的一只走卒。相反，一名牧师可能自认作一名忠心的奴仆，并协助推进某神的计划，或是参与到各种神能的阴谋斗争中。因而这名战士会与一支雇佣兵团或是军队接触，而牧师则可能会认识一些与其拥有共同信仰的教士、圣武士和信徒。</p>
<p>你的职业会赋予你一系列特别的特性，例如战士对武器与护甲的精通，或是法师的法术。在低等级时，职业只能带给你两三个特性。但是，随着你在冒险中进一步提升等级，也将从中获得更多特性或是使现有的特性得以提升。</p>
<p>冒险者有时候还会向着多种职业的方向发展。一名游荡者可能会改变其生活方式而转向奉献于圣武士的誓言。一名野蛮人可能发现自己潜藏的魔法能力进而涉猎术士之道，却依然以野蛮人的身份继续冒险。精灵们以结合武艺与魔法的修炼，并同时提升其战士与法师水平而闻名。以这种方式运作的混合职业可选规则为兼职。 </p>
<p>5e规则中（2014版），职业一共有十二种：野蛮人Barbarian、战士Warrior、法师Mage、牧师Priest、游侠Ranger、圣武士Paladin、武僧Monk、德鲁伊Druid、术士Sorcerer、游荡者Rogue、魔契师Warlock、吟游诗人Bard。由于篇幅原因不在此过多赘述，详情可参考相关资料</p>

`,
`
<h1>决定属性值</h1>
<p>六项属性值是生物个体身心特色的核心指标：<br>
    <span class="extra-bold">力量Strength，</span>体能的量化<br>
    <span class="extra-bold">敏捷Dexterity，</span>灵活度的量化<br>
    <span class="extra-bold">体质Constitution，</span>耐受力的量化<br>
    <span class="extra-bold">智力Intelligence，</span>记忆与思维能力的量化<br>
    <span class="extra-bold">感知Wisdom，</span>直觉与感受能力的量化<br>
    <span class="extra-bold">魅力Charisma，</span>个性气质的量化
</p>
<p>一个角色是否聪敏强壮?是否才智兼备?是否灵敏结实？这些素质皆由属性值进行定义，这其中的项目可能会作为其强项或是短板。</p>
<p>游戏中的三种主要掷骰（属性检定、豁免检定和攻击检定），均依赖六项属性值进行。而其掷骰的基本规则为：掷一粒d20，加上从六项属性值之一所导出的调整值，然后将总结果与目标值相比较。如果总结果大于或等于目标值，则检定成功；否则失败。</p>
<p>普通人类的平均属性值为10至11，而冒险者和许多怪物的多项能力都高于常人。一般人的属性值通常最高可以达18，而冒险者则可达到20，怪物与神甚至可以高至30。</p>
<p>每项属性同时也对应着一项调整值，其数值范围在-5（对应属性值1）到+10（对应属性值30）之间。想要在不查阅表格的情况下算出某个属性的调整值时，只需将相应的属性值减去10然后除以2（向下取整）。</p>
<p>属性调整值几乎影响所有的攻击检定、属性检定和豁免检定，因此调整值在游戏中甚至比属性值本身更为常用。</p>
`,
`
<h1>确定背景</h1>
<p>每个故事都有一个开头。角色的背景项解释了其来历，如何成为一名冒险者，以及其在世界中的地位。你的战士可能曾经是一名勇敢的骑士或一名爱哭爱抱怨的士兵。你的法师可能曾经是一名贤者或一名工匠。你的游荡者可能曾经是一名公会盗贼或是一名蛊惑大众的宫廷弄臣。</p>
<p>选择一个背景为你提供了关于该角色身份的重要故事提示。该背景所述的关键问题是：什么发生了变化？你是由于什么原因而放弃背景所描述的生活转而开始了冒险？你如何获得你的起始装备？或者，如果你曾经富有，为何你没有更多的钱财？你如何学会现在的职业技能？又是什么让你与故乡里的普通人有所区别？</p>
<p>5e规则中（2014版），提供了十三种背景供玩家选择：贵族Noble、士兵Soldier、智者Sage、化外之民Outlander、平民英雄Folk Hero、罪犯Criminal、公会工匠Guild Artisan、隐士Hermit、骗子Charlatan、艺人Entertainer、侍僧Acolyte、流浪儿Urchin和水手Sailor。每个背景都提供了一些技能加值和特性，并且可以帮助你更好地理解角色的动机和行为。</p>
`
,
`
<h1>描述角色</h1>
<p>除种族和职业之外，一个角色还可以拥有更多作为补充的描述内容。作为独特的个体，他们自身的故事、兴趣、人脉和能力还可以用其他要素作定义。本章详细解释了每个角色区别于他人的各种细节，包括名字和身体特征，背景与语言的规则，以及个性和阵营的闪光点。</p>
<p><span class="extra-bold">姓名：</span>你的角色在选择种族时，可以在相应的种族描述中找到相应的命名范例。不过就算你直接从所列举的范例中选择，也值得好好考虑选择的标准。</p>
<p><span class="extra-bold">性别：</span>你可以随意扮演男性或女性角色，并且不会因其性别差异而获得任何特殊的增益或减益。思考一下角色在接触各种文化时，对关于性别及与性别相关的行为和关系等内容时可能作出的反应。例如，一名男性卓尔成为了牧师，并因此违背了卓尔社会的性别歧视传统，这也可能令他决心离开故乡前往地表。<br>你不必受限于社会或自然的两性选项。精灵神柯瑞隆·拉瑞斯安Corellon Larethian就经常以中性性别或雌雄同体的形态出现，而多元宇宙中的一些精灵正是按柯瑞隆的这种形象所创生。你同样可以扮演一个将自己视作男人的女性角色，或是一个感到自己被困在女性身体中的男人，又或是一个恨自己错生为男人的长胡子女矮人。此外，你还可以随意决定自己角色的性取向。</p>
<p><span class="extra-bold">身高与体重：</span>你可以根据所选种族的描述信息，或根据表格“随机身高体重”来决定角色的身高体重。设想一下角色的属性值与其身高体重的关联。一个柔弱而灵巧的角色可能会很瘦。而一个强壮坚韧的角色应该会显得高大魁梧。你也可以使用“随机身高体重”表投骰决定角色的身高体重。</p>
<p><span class="extra-bold">其他生理特征：</span>你可以随意设定角色的年龄、发色、瞳色和肤色。你也可以为其设定一些特别的生理特征增强其存在感，比如一条疤痕，一条跛足或一幅刺青。</p>
`,
`
<h1>选择阵营</h1>
<p>D&D世界中任一个特定的生物都属于与之相应的阵营，并以此大致反映该个体的品行举止。角色的阵营由两个因素组合而成：一个确定道德（善良、邪恶、中立），另一个则描述其对社会及秩序的态度（守序、混乱、中立）。两个因素两相组合，组成了九个不同的阵营。</p>
<p>以下关于九阵营的简介描述了一个该阵营生物的典型行为。特定个体间的表现可能有着不小的差异，而且也很少有人能一贯完美的忠于其阵营准则。</p>
<p><span class="extra-bold">守序善良Lawful Good(LG)：</span>守序善良生物尽力做社会认为正确的事情。毫不犹豫地与不公作斗争、保护无辜者的人，可能是守序善良的。</p>
<p><span class="extra-bold">中立善良Neutral Good(NG)：</span>中立善良生物尽其所能地做行善，在规则限度内行事，但并不感觉被规则束缚。按照他人需求帮助他们的和善之人，可能是中立善良的。</p>
<p><span class="extra-bold">混乱善良Chaotic Good(CG)：</span>混乱善良生物依照其良心行动，几乎不在意别人怎么想。拦路抢劫某个冷酷男爵的税官，将赃款用于帮助穷人的人，可能是混乱善良的。</p>
<p><span class="extra-bold">守序中立Lawful Neutral(LN)：</span>守序中立的个体依法律、传统或个人信条办事。遵守一套严格的行事准则，且不会被临危者的请求或邪恶的诱惑动摇的人，可能是守序中立的。</p>
<p><span class="extra-bold">绝对中立Neutral(N)：</span>绝对中立阵营是那些宁可回避道德问题，不愿意选边站，按当时看来最好的做法行事的人的阵营。厌倦了道德思辨的人可能是绝对中立的。</p>
<p><span class="extra-bold">混乱中立Chaotic Neutral(CN)：</span>混乱中立的生物按其一时奇想行事，认为他们的个人自由比其他一切都重要。靠小聪明谋生、四处游荡的流氓，可能是混乱中立的。</p>
<p><span class="extra-bold">守序邪恶Lawful Evil(LE)：</span>守序邪恶的生物有条不紊地在传统、忠诚或秩序的规定之内获取他们想要的东西。在利用市民同时又阴谋获取权力的贵族，可能是守序邪恶的。</p>
<p><span class="extra-bold">中立邪恶Neutral Evil(NE)：</span>中立邪恶是那些不在意在追逐自身想要的东西过程中造成破坏的人所属的阵营。随心所欲抢劫杀人的罪犯，可能是中立邪恶的。</p>
<p><span class="extra-bold">混乱邪恶Chaotic Evil(CE)：</span>混乱邪恶的生物会随意施暴，这种暴力受其憎恨或嗜血欲望的驱策。致力于复仇与破坏之阴谋的恶棍，可能是混乱邪恶的。</p>
<br>
<p>tips:绝大多数缺乏理性思维能力的生物没有阵营归属，即它们是无阵营。比如，鲨鱼是凶猛的掠食者，但它们并不邪恶，因此它们无阵营。

`


];

window.addEventListener('DOMContentLoaded', function () {

  //音乐播放
      const audio = document.getElementById("bgm");

    // 先解除静音
    audio.muted = false;

    // 尝试播放
    const playPromise = audio.play();

    if (playPromise !== undefined) {
      playPromise
        .then(() => {
          console.log("BGM 正常自动播放");
        })
        .catch(error => {
          console.warn("自动播放失败，可能需要用户交互触发播放：", error);
        });
    }

});

let currentPage = 0;
const container = document.getElementById('text-container');
const prevButton = document.getElementById('prev-button');
const nextButton = document.getElementById('next-button');

function showPage(index) {
  container.style.opacity = 0; // 淡出
  setTimeout(() => {
    container.innerHTML = pages[index];
    container.style.opacity = 1; // 淡入
  }, 300);
}

// 初始显示第一页
showPage(currentPage);

// 点击上一页
prevButton.addEventListener('click', () => {
  if (currentPage > 0) {
    currentPage--;
    showPage(currentPage);
  }
});

// 点击下一页
nextButton.addEventListener('click', () => {
  if (currentPage < pages.length - 1) {
    currentPage++;
    showPage(currentPage);
  }
});
