const pages = [
  `   <div>
          <img id="title-image" src="../pic/intro-title.png" alt="Introduction Title">
      </div>

      <h1>D&D是什么</h1>
      <p>D&D即为Dungeons & Dragons，中文翻译为“龙与地下城”。龙与地下城是一款剑与魔法奇幻背景的叙事性角色扮演游戏。与孩提时代的过家家扮演游戏相似，D&D依靠的是玩家无穷的想象力。你所需要做的，即是描述场景如暴风骤雨里，夜空下的某座高耸古堡。然后想象奇幻世界中的冒险者们会如何迎接即将到来的挑战。 </p>
      <p>与随意的过家家游戏不同，D&D为冒险故事设定了一系列规则。并以此决定冒险者们在故事中行动的结果。玩家会通过掷骰来决定其攻击是否能命中敌人，冒险者是否能攀上悬崖，躲开一道魔法闪电，或是完成其他充满危险的任务。一切皆有可能，但是幸运女神总会青睐于更有把握的一方。</p>
      <p>在龙与地下城的游戏中，每一位玩家都会创作一名冒险者角色。而这些角色将组建起一支团队，并且互相协助一起去探索阴暗的地下城，古都的废墟，闹鬼的城堡，深林中失落的神庙或是充满熔岩的洞窑。冒险者们可能需要解开一道道谜题，与其他角色交涉，同奇幻世界中的怪物战斗，探寻惊奇的魔法物品与财宝。</p>
      <p>此外，其中的一位玩家必须作为地下城主（DM）来担当游戏的裁判和故事的讲述者。角色们在DM所编写的冒险内容里选择如何披荆斩棘，以及该走向何方。DM先绘声绘色地描述鸦阁堡入口的场景，然后玩家们再决定自己的冒险者接下来如何行动。他们是否会穿过那座久经风霜的危险吊桥？会不会用绳子将同伴与自己系在一起以防其中一人跌入深谷？或是施放一道法术帮助他们跨过鸿沟？</p>
      <p>接下来DM将会判定冒险者们行动的结果，然后根据结果描述出冒险者遭遇的经历。因为DM可以根据玩家们的行动做出应变，所以D&D拥有无限的灵活性。这也使得每一场冒险独一无二，同时激动人心。</p>
      <p>游戏并没有真正的结局。一段故事或任务告一段落后，另一段传奇便会开始。这种连续的冒险故事称为<span class="extra-bold">战役campaign</span>。很多玩家的战役可以持续数月甚至数年，他们每周与朋友相聚，然后继续上一周的冒险。冒险者在战役的进行过程中会越发强大。每一个被打倒的怪物，每一次完成的冒险和获得的宝藏不仅仅使得战役得以继续，还会给予冒险者新的能力。这种力量的提升则通过冒险者的等级系统表现。</p>
      <p>龙与地下城的游戏中并没有输赢的概念，至少与通常情况下我们所理解的有所不同。勇敢的冒险者们克服艰难苦难的精彩故事需要由DM与玩家们一同编写。有时冒险者会被凶猛的怪物打败，或被穷凶极恶的敌人所害而导致悲剧结尾。即使如此，其他的冒险者仍可通过探寻强大的魔法来复活他们逝去的同伴。而玩家也可以创造一个新的角色继续冒险。队伍可能会遭遇失败，但是只要每一个成员都度过了美好的时光并创造了令人回味的故事，那么所有人都是赢家。</p>
`,
`
<h1>世界观</h1>
<p>龙与地下城的诸多世界中充满了魔法和怪物，以及勇敢的斗士和壮丽的冒险。这一切以中世纪奇幻风格为基础，并加入能让这个世界变得独一无二的生物、地点和魔法。</p>
<p>龙与地下城的诸世界都位于一个叫<span class="extra-bold">多元宇宙multiverse</span>的广袤宇宙当中。这些世界以神秘而奇异的方式互相连接，并关联至诸多的存在位面。比如火元素位面Elemental Plane of Fire和无底深渊Infinite Depths of the Abyss。多元宇宙中存在着数不清的世界，其中也有许多是出版过的官方设定。各个世界的传奇在多元宇宙中被交织在一起，其中包括被遗忘国度Forgotten Realms、龙枪Dragonlance、灰鹰Greyhawk、浩劫残阳Dark Sun、密斯塔拉Mystara和艾伯伦Eberron。除此之外，还有各世代D&D规则下玩家创造的无数个世界。而在富饶的多元宇宙中，你或许也会创造出属于自己的世界。</p>
<p>这些世界有一些共同之处，但是每个世界都拥有独特的历史与文化、怪物与种族、奇幻般的地理、古老的地下城和诡计多端的恶敌。在不同世界中相同的种族有着不同的特性。比如浩劫残阳中的半身人是栖息在雨林中的食人族，而精灵则是沙漠中的游牧者。有些世界有着独一无二的种族，比如艾伯伦的战俑warforged。他们是为投入终末战争Last War而被注入生命的士兵。另一些世界是围绕着一个故事进行的，比如长枪之战War of the Lance便是龙枪设定中的核心事件。而它们全都是D&D的世界。你可以使用本书中的规则创造一名角色，然后在这些世界中畅游。 </p>
<p>你的DM可能会将战役设定与这些世界之一，或是其自创的世界。因为有太多的D&D世界可供选择，你需要与你的DM确认好房规，因为这将影响到整个游戏。而即使是公开出版的设定，地下城主也是战役与设定的权威解释者。</p>
`,
`<h1>认识骰子</h1>
<p>游戏会用到不同面数的骰子。你可以在桌游店中买到这些东西。在本规则中，不同的骰子用字母d以及后面跟一个骰子的面数表示：即d4、d6、d8、d10、d12、d20。比如d6即是一粒六面骰（也就是很多游戏所使用的正方体骰子）。</p>
<p>冒险者的剑有没有砍伤巨龙，还是砍不破它那钢铁般的龙鳞？那名食人魔会不会相信一个弥天大谎？一名角色能不能游过波涛凶涌的河流？这位冒险者可不可以避过火球的爆炸，还是首当其冲？当行动的结果无法被确定时，大部分情况下DM会要使用一枚二十面骰，即d20来决定成败。
<div>
    <img id="dice-image" src="../pic/dices.jpg" alt="D&D Dice">
</div>

`,
`
<h1>如何进行游戏</h1>
<p>龙与地下城的游戏按照以下的基础框架运行。</p>
<p><span class="extra-bold">1.由DM描述环境。</span>DM向玩家们说明冒险小队身处何地，他们四周的环境，以及一些可供角色行动的选项。（房间里有几扇门、桌上放着些什么、有谁在旅店里，诸如此类。）</p>
<p><span class="extra-bold">2.玩家说明他们要做什么。</span>有时会由一个人代表全队说话，例如“我们朝东面的门走。”有时，冒险者会各自行动：可能有一个人去搜查宝箱，另一个人去调查墙上刻着的神秘符号，而第三个人则去放哨提防怪物。玩家们不需要轮流行动，但DM要仔细倾听每一个人并决定如何判定这些行动。</p>
<p><span class="extra-bold">3.DM描述这些行动的结果。</span>通常这些结果会向玩家给出另一个选择点，将游戏带回步骤1。<br>不论冒险者是在小心地探索古迹、跟奸诈的王子打交道、还是与一只凶猛的巨龙搏斗，该模式都同样适用。有时这些行动会比较规范，比如，玩家们（和DM）在战斗时将会轮流选定并执行各自的动作。很多时候，为了适应冒险中发生的各种状况，游戏依然会在维持其连续性的同时保持变通。</p>
<p>通常游戏中的行动只存在于玩家和DM的想象中，其中大多都要依赖DM的口述说明。有些DM会用音乐、插图、声效等营造气氛，也有很多玩家和DM会用不同嗓音扮演不同的冒险者、怪物以及其他游戏中的人物角色。DM可能会用地图和指示物物或微缩模型来表现一个场景内的生物，以帮助玩家记录角色所在的位置。</p>

`
];

window.addEventListener('DOMContentLoaded', function () {

  //音乐播放
      const audio = document.getElementById("bgm");

    // 先解除静音
    audio.muted = false;

    // 尝试播放
    const playPromise = audio.play();

    if (playPromise !== undefined) {
      playPromise
        .then(() => {
          console.log("BGM 正常自动播放");
        })
        .catch(error => {
          console.warn("自动播放失败，可能需要用户交互触发播放：", error);
        });
    }

});

let currentPage = 0;
const container = document.getElementById('text-container');
const prevButton = document.getElementById('prev-button');
const nextButton = document.getElementById('next-button');

function showPage(index) {
  container.style.opacity = 0; // 淡出
  setTimeout(() => {
    container.innerHTML = pages[index];
    container.style.opacity = 1; // 淡入
  }, 300);
}

// 初始显示第一页
showPage(currentPage);

// 点击上一页
prevButton.addEventListener('click', () => {
  if (currentPage > 0) {
    currentPage--;
    showPage(currentPage);
  }
});

// 点击下一页
nextButton.addEventListener('click', () => {
  if (currentPage < pages.length - 1) {
    currentPage++;
    showPage(currentPage);
  }
});
